import numpy as np
#2. Создаём массив из списка.
# Список можно заранее записать в переменную.

a = np.array([1, 2, 3, 4])
print(a)

#массив, заполненный нулями
a = np.zeros((3, 3))
print(a)
#массив, заполненный единицами
a = np.ones((2, 5))
print(a)

#заполненный рандомными числами от 0 до 1:
a = np.random.random((2, 5))
print(a)

#заполненный последовательностью чисел.
# В круглых скобках указываем начало, конец и шаг:
a = np.arange(0, 10, 2)
print(a)

#заполненный числами, равно распределёнными между друг другом. В круглых скобках указываем начало, конец и количество чисел:
a = np.linspace(0, 1, 10)
print(a)